app/controllers/admins_backoffice/admins_controller.rb

  def index
    @admins = Admin.all.page(params[:page])
---
SELECT  "admins".* FROM "admins" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "admins"

  def create
    @admin = Admin.new(params_admin)
    if @admin.save()
---
INSERT INTO "admins" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def edit
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    if @admin.update(params_admin)
---
UPDATE "admins" SET "email" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "admins"."id" = ?  [["email", "admin@admin.com"], ["encrypted_password", "$2a$11$jphzCfO1E0ZgnCLpaQ5w/.KzENQNt7AyRD0Ejlvk2iSCFTVFD2J6q"], ["updated_at", "2019-03-18 17:53:39.810001"], ["id", 1]]

  def destroy
    if @admin.destroy
---
DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 3]]

  def set_admin
    @admin = Admin.find(params[:id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]