app/controllers/admins_backoffice/questions_controller.rb

SELECT  "questions".* FROM "questions" ORDER BY "questions"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT COUNT(*) FROM "questions"
---
  def index
    @questions = Question.includes(:subject)
                         .order(:description)
                         .page(params[:page])

INSERT INTO "questions" ("description", "subject_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Aquiiiiiadsadfag"], ["subject_id", 18], ["created_at", "2019-03-19 16:07:50.488276"], ["updated_at", "2019-03-19 16:07:50.488276"]]
---
  def create
    @question = Question.new(params_question)
    if  @question.save

UPDATE "questions" SET "subject_id" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["subject_id", 7], ["updated_at", "2019-03-19 16:07:59.370301"], ["id", 94]]
---
  def update
    if  @question.update(params_question)

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 985]]
---
  def destroy
    if  @question.destroy

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 94], ["LIMIT", 1]]
---
  def set_question
    @question = Question.find(params[:id])