app/controllers/admins_backoffice/subjects_controller.rb

SELECT  "subjects".* FROM "subjects" ORDER BY "subjects"."description" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM "subjects"
---
  def index
    @subjects = Subject.all.order(:description).page(params[:page])

INSERT INTO "subjects" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "Algoritmos em grafos"], ["created_at", "2019-03-18 20:16:04.171775"], ["updated_at", "2019-03-18 20:16:04.171775"]]
---
  def create
    @subject = Subject.new(params_subject)
    if @subject.save()

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @subject = Subject.find(params[:id])

UPDATE "subjects" SET "description" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["description", "Administração de Recursos Materiaissss"], ["updated_at", "2019-03-18 20:13:28.820915"], ["id", 2]]
---
  def update
    if @subject.update(params_subject)

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_subject
    @subject = Subject.find(params[:id])